src/main/java/ru/vk/itmo/test/kovalevigor/reports/html/stage5/async_put_18000_wrk.txt
Running 20s test @ http://localhost:8080
  8 threads and 128 connections
  Thread calibration: mean lat.: 102.826ms, rate sampling interval: 475ms
  Thread calibration: mean lat.: 101.806ms, rate sampling interval: 476ms
  Thread calibration: mean lat.: 101.864ms, rate sampling interval: 475ms
  Thread calibration: mean lat.: 115.721ms, rate sampling interval: 561ms
  Thread calibration: mean lat.: 102.449ms, rate sampling interval: 478ms
  Thread calibration: mean lat.: 111.469ms, rate sampling interval: 538ms
  Thread calibration: mean lat.: 104.950ms, rate sampling interval: 497ms
  Thread calibration: mean lat.: 103.272ms, rate sampling interval: 486ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   802.30ms  438.72ms   1.74s    55.75%
    Req/Sec     1.94k   143.16     2.34k    65.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  731.14ms
 75.000%    1.22s 
 90.000%    1.42s 
 99.000%    1.61s 
 99.900%    1.70s 
 99.990%    1.73s 
 99.999%    1.74s 
100.000%    1.74s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     106.687     0.000000            1         1.00
     277.503     0.100000        15345         1.11
     354.815     0.200000        30697         1.25
     428.543     0.300000        46050         1.43
     551.423     0.400000        61353         1.67
     731.135     0.500000        76705         2.00
     827.903     0.550000        84367         2.22
     939.007     0.600000        92041         2.50
    1064.959     0.650000        99704         2.86
    1149.951     0.700000       107407         3.33
    1217.535     0.750000       115031         4.00
    1250.303     0.775000       118898         4.44
    1285.119     0.800000       122794         5.00
    1314.815     0.825000       126563         5.71
    1348.607     0.850000       130392         6.67
    1381.375     0.875000       134240         8.00
    1398.783     0.887500       136125         8.89
    1417.215     0.900000       138032        10.00
    1436.671     0.912500       139936        11.43
    1457.151     0.925000       141938        13.33
    1477.631     0.937500       143804        16.00
    1487.871     0.943750       144734        17.78
    1501.183     0.950000       145742        20.00
    1512.447     0.956250       146648        22.86
    1525.759     0.962500       147647        26.67
    1540.095     0.968750       148601        32.00
    1547.263     0.971875       149065        35.56
    1555.455     0.975000       149554        40.00
    1565.695     0.978125       150015        45.71
    1575.935     0.981250       150495        53.33
    1590.271     0.984375       150985        64.00
    1596.415     0.985938       151214        71.11
    1603.583     0.987500       151444        80.00
    1609.727     0.989062       151692        91.43
    1615.871     0.990625       151919       106.67
    1624.063     0.992188       152160       128.00
    1630.207     0.992969       152276       142.22
    1639.423     0.993750       152417       160.00
    1644.543     0.994531       152527       182.86
    1649.663     0.995313       152652       213.33
    1655.807     0.996094       152757       256.00
    1659.903     0.996484       152821       284.44
    1662.975     0.996875       152888       320.00
    1666.047     0.997266       152934       365.71
    1672.191     0.997656       152997       426.67
    1677.311     0.998047       153052       512.00
    1680.383     0.998242       153086       568.89
    1683.455     0.998437       153116       640.00
    1687.551     0.998633       153146       731.43
    1691.647     0.998828       153174       853.33
    1696.767     0.999023       153206      1024.00
    1699.839     0.999121       153217      1137.78
    1702.911     0.999219       153236      1280.00
    1704.959     0.999316       153250      1462.86
    1707.007     0.999414       153266      1706.67
    1710.079     0.999512       153277      2048.00
    1712.127     0.999561       153285      2275.56
    1714.175     0.999609       153294      2560.00
    1715.199     0.999658       153299      2925.71
    1717.247     0.999707       153309      3413.33
    1718.271     0.999756       153315      4096.00
    1719.295     0.999780       153321      4551.11
    1720.319     0.999805       153323      5120.00
    1722.367     0.999829       153326      5851.43
    1723.391     0.999854       153329      6826.67
    1725.439     0.999878       153335      8192.00
    1725.439     0.999890       153335      9102.22
    1726.463     0.999902       153339     10240.00
    1726.463     0.999915       153339     11702.86
    1727.487     0.999927       153341     13653.33
    1728.511     0.999939       153343     16384.00
    1728.511     0.999945       153343     18204.44
    1729.535     0.999951       153346     20480.00
    1729.535     0.999957       153346     23405.71
    1729.535     0.999963       153346     27306.67
    1736.703     0.999969       153347     32768.00
    1736.703     0.999973       153347     36408.89
    1737.727     0.999976       153348     40960.00
    1737.727     0.999979       153348     46811.43
    1739.775     0.999982       153350     54613.33
    1739.775     0.999985       153350     65536.00
    1739.775     0.999986       153350     72817.78
    1739.775     0.999988       153350     81920.00
    1739.775     0.999989       153350     93622.86
    1739.775     0.999991       153350    109226.67
    1739.775     0.999992       153350    131072.00
    1739.775     0.999993       153350    145635.56
    1742.847     0.999994       153351    163840.00
    1742.847     1.000000       153351          inf
#[Mean    =      802.300, StdDeviation   =      438.720]
#[Max     =     1741.824, Total count    =       153351]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  330853 requests in 20.00s, 39.13MB read
Requests/sec:  16543.43
Transfer/sec:      1.96MB